package com.kusitms.wannafly.support.fixture;

public class ApplicationFormText {

    public static String QUESTION = "본 직군으로 지원을 결정하시게 된 계기를 말하고, 그 동안의 노력도 말해주세요. (1000자 이내)";
    public static String ANSWER = """
            저는 Back-end 분야를 희망합니다. 백엔드 개발을 진행하고 학습할 수록 여러가지 매력을 느꼈습니다.
            첫 번째로 서비스의 비즈니스 규칙을 구현할 수 있다는 점입니다. 서비스에는 여러 규칙과 제약이 존재하고 이들은 반드시 지켜지고 절차대로 이행되어야 합니다. 버그를 줄이고 효율적으로 규칙과 제약을 구현하기 위해 고민하고 동료들과 소통하는 과정이 가치있게 느껴졌고 재미 또한 느꼈습니다.
            두 번째로 규칙과 제약을 구현한 코드를 보호하고 유지보수하기 쉽게 하기 위해 여러 디자인 패턴이나 개발 방법론을 고민하고 적용하는 과정도 흥미로웠습니다. 코드의 길이부터 의존성 방향, 나아가 전체적인 소프트웨어 아키텍처 설계까지 정답이 없는 문제에 자신과 팀만의 답을 찾아나가는 과정을 계속 겪어보고 싶다는 생각을 하고 있습니다.
            백엔드 개발자를 희망한 이후부터 필요한 역량을 쌓기 위해 꾸준히 학습해왔습니다. 처음에는 인터넷 강의로 학습을 시작했습니다. 혼자보다 함께 학습하고 싶어서 스터디에 참여해 보기도 했지만 독학에 한계를 느꼈습니다. 양질의 학습과 경험을 하고 싶어서 ‘우아한테크코스’라는 교육 프로그램에 지원했고 한 달 간 코딩 테스트와 과제 전형을 거쳐 합격할 수 있었습니다. 교육 중에는 매주 과제를 수행하고 코드 리뷰를 받으며 TDD, 객체지향, 자바 및 스프링 등의 학습을 진행했습니다. 학습이 어느정도 진행된 후에는 5개월 간 팀 프로젝트를 진행했으며 지속적인 배포와 유지보수를 경험할 수 있었습니다.
            교육을 수료한 이후에는 졸업 프로젝트와 IT 연합 동아리에서 백엔드 개발자로 참여하여 협업을 계속 이어나가고 있습니다.
            """;
}
